---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.TextureLinkTextureTransforms
source: html/af71ce35-09b8-4e14-8a01-065273b47b18.htm
---
# Autodesk.Revit.DB.Visual.Speckle.TextureLinkTextureTransforms Property

The property labeled "Link Transforms" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string TextureLinkTextureTransforms { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".